popoC/msp430/半圓形馬達控制板/main - 複製.cpp
//----2010/10/07 加入SD卡以及電子羅盤
//******************************************************************************
// ***** I/O **** .......4/19
// P1   *************************              
// P2.0     input   interrupt for set or start
// P2.1     input   interrupt for test mode
// P2.2~7   X       for nothing  
// P3.4~7   I/O     for RS232
//    P4.0 P4.1  開關RELAY     //----注意 PWM 可使用的腳位為 P4.1~7 
//    P4.2 3 4 5 可當PWM使用  ((目前板子上6 7 要換到 2 3腳)) 先寫 4 5兩PIN 
//    ch1  P4.4 P4.5    output  for motorA
//    ch2  P4.2 P4.3    output  for motorB
// P5.
//   P6.0  **無法使用 ...因為腳沒接出來((褐色板子
//---- AD 請使用 P6.1 開始             ((褐色板子
//******************************************************************************
#include  <msp430x16x.h>
#include <stdio.h>

#define abs(x)( (x) > 0 ? (x) : (-x))
#define CW  1
#define CCW 0

void MotoControl_Stop(int ch);
void MotoControl_Run(int ch,int cw_ccw);
void PwmSet();
void GoToRange_V2();
void GoHome();

void write_flash_segA();
void read_flash_segA();
//---------------UR----function-------------------------------------------------
   void Rs232_Init();
   void UART1_SendByte(unsigned char data);
   void UART1_SendStr(char *str);
//--------------------------------------------------------------------
double Angle_X ;
double Angle_Y ;

int Hand_X_Time = 0,Hand_X_Dir=1,Hand_Y_Time=500,Hand_Y_Dir=0;

//static unsigned  long int outPut_Buf = 1620;
static unsigned int results[2];             // Needs to be global in this example
void AD_Init();
void DoTheAd(int avgtime,bool print);



int pow(int i,int j);
//------處理RS232輸入訊號及顯示用 
char command[255];  int coMMand_N = 0; int coMMand_Mode =0;  char string[255];
int GetInputVal(int G);
//--------------------------------
 unsigned long int countTime = 0;
 int ControlMode = 1;             
 
 int AD_AVGtime = 1000;           
 int motor_T_AD = 10;             
 int Set_OriginX = 10;
 int Set_OriginY = 10;
 int move1deg_T = 10; 

          int frequency_pwm = 500;                
unsigned  int percent_pwm = 50; 
 int WantToAngle = 0;           
 int RunTime;

     //frequency_pwm
    // percent_pwm 
              int ReStart_Day = 7;                 // 7.
unsigned long int ReStart_Sec = 0;  // 8.
unsigned int FirstStart_Sec = 0;              //9.
int startCount = 1;

//-----------------------------------

bool FirstStart = true;
bool outPutcount = true;    
unsigned long int count_back = 0;


void OpenMotorPower();
void CloseMotorPower();
//------------------------------------------------------------------------------
void main(void)
{
  WDTCTL = WDTPW+WDTHOLD;                   // Stop watchdog timer
  FCTL2 = FWKEY + FSSEL0 + FN0;             // MCLK/2 for Flash Timing Generator

  read_flash_segA();
  
  Rs232_Init();                             //  RS232 初始化      115200   P3  

  P4DIR = 0xff;                             // Set P4. to output direction 
  P4OUT = 0;

  TBCTL = TBSSEL_2 + MC_1;                  // SCLK, up-down mode  PWM timeClock
  
  AD_Init();
 
  WDTCTL = WDT_ARST_1000;                   //--開狗
  
  CloseMotorPower();       //----開電測試系統  
  
     // TimerA 啟動讀秒
      TACCTL0 = CCIE;                             // CCR0 interrupt enabled
      TACCR0 = 16384-1;                           // for 0.5 Hz
      TACTL = TASSEL_1 + MC_1;                    // ACLK, contmode  

      _BIS_SR(LPM0_bits + GIE);   

      
      
  IE2 &= ~URXIE1 ;                           // Disable USART1 RX interrupt

  ReStart_Sec +=  ((unsigned long int)ReStart_Day * 3600);  //--
  
int testRun = 0;
      
      
      
      PwmSet();
while(1)
  {
    testRun++;
       sprintf(string,"第%02d次轉動   \r\n",testRun); UART1_SendStr(string);
       
    outPutcount = false;

    OpenMotorPower();       //----開電  
    GoToRange_V2();
    GoHome();
    CloseMotorPower();       //----關電  

    outPutcount = true;
    _BIS_SR(LPM0_bits + GIE);                 // Enter LPM0, Enable interrupts
  }
  
  
}

//-------------------------中斷-------------------------------------------------
#pragma vector=UART1RX_VECTOR
__interrupt void usart1_rx (void)
{
       command[coMMand_N] = RXBUF1;
       coMMand_N++;

       if(command[coMMand_N-1]==0x1B){      //  ESC
         coMMand_Mode = 0;
         coMMand_N = 0;
         return;
       }
       if (command[coMMand_N-1]==0x0D){     // Enter
          
           switch(coMMand_Mode){
           case 0:
               if(command[0] == 'k'){ 

                 coMMand_Mode = 99;
            //    string[0] = '\r' ;string[1] = '\n' ;  
            sprintf(string,"please select the function \r\n");                  UART1_SendStr(string);
            sprintf(string," ------V3.10------\r\n");                                UART1_SendStr(string);
            sprintf(string,"1. 控制模式((手動=0 自動回歸原點=1 %04d \r\n",ControlMode);       UART1_SendStr(string);
            sprintf(string,"2. 角度AD平均次數 = %04d \r\n",AD_AVGtime);            UART1_SendStr(string);
            sprintf(string,"3. 馬達轉動後讀取AD之延遲時間 = %04d \r\n",motor_T_AD);             UART1_SendStr(string);
            sprintf(string,"4. 原點_X = %04d \r\n",Set_OriginX);           UART1_SendStr(string);
            sprintf(string,"5. 原點_Y= %04d \r\n",Set_OriginY);            UART1_SendStr(string);
            sprintf(string,"6. 移動1度所需時間(請依據馬達特性修改 = %04d  \r\n",move1deg_T);            UART1_SendStr(string);
            sprintf(string,"7. pwm_頻率 = %06d \r\n",frequency_pwm);       UART1_SendStr(string);
            sprintf(string,"8. pwm_百分比 = %05d (0~100) \r\n",percent_pwm);   UART1_SendStr(string);
            sprintf(string,"9. 自動找尋原點次數 = %05d (0~5000) \r\n",RunTime);        UART1_SendStr(string);
            sprintf(string,"a. 手動控制 移動X軸時間 = %05d (0~65000) \r\n",Hand_X_Time);UART1_SendStr(string);
            sprintf(string,"b. 手動控制 移動X軸方向 = %05d (0~65000) \r\n",Hand_X_Dir); UART1_SendStr(string);
            sprintf(string,"w. 手動控制 移動Y軸時間 = %05d (0~65000) \r\n",Hand_Y_Time);UART1_SendStr(string);
            sprintf(string,"d. 手動控制 移動Y軸方向 = %05d (0~65000) \r\n",Hand_Y_Dir); UART1_SendStr(string);

            sprintf(string,"e. 第一次啟動時間 = %05d (0~65000) 秒\r\n",FirstStart_Sec);UART1_SendStr(string);
            sprintf(string,"f. 每隔%02d小時重新啟動                \r\n",ReStart_Day); UART1_SendStr(string);
            sprintf(string,"g. 倒數暫停 (0暫停 1繼續 ) \r\n");UART1_SendStr(string);

