popoC/msp430/半圓形馬達控制板/main - 複製.cpp
            sprintf(string," --------------------\r\n");         UART1_SendStr(string);
               }  
             
               break;
           case 99:
             
                coMMand_Mode  =  command[0];
              switch(coMMand_Mode){
               case '1':             
                    sprintf(string," ControlMode  = (預設為1");       UART1_SendStr(string);
                break;
               case '2':
                    sprintf(string," AD_AVGtime    =   ");             UART1_SendStr(string);
                break;
               case '3':
                    sprintf(string," motor_T_AD =   ");             UART1_SendStr(string);
                break;
               case '4':
                    sprintf(string," Set_OriginX=   ");             UART1_SendStr(string);
                break;
               case '5':
                    sprintf(string," Set_OriginY =   ");        UART1_SendStr(string);
                break;
               case '6':
                    sprintf(string," move1deg_T =   ");        UART1_SendStr(string);
                break;
               case '7':
                    sprintf(string," frequency_pwm =   ");      UART1_SendStr(string);
                break;
               case '8':
                    sprintf(string," percent_pwm =   ");       UART1_SendStr(string);
                break;
               case '9':
                    sprintf(string," RunTime =   ");       UART1_SendStr(string);
                break;
               case 'a':
                    sprintf(string," Hand_X_Time =   ");       UART1_SendStr(string);
                break;
               case 'b':
                    sprintf(string," Hand_X_Dir =   ");       UART1_SendStr(string);
                break;
               case 'w':
                    sprintf(string," Hand_Y_Time =   ");       UART1_SendStr(string);
                break;
               case 'd':
                    sprintf(string," Hand_Y_Dir =   ");       UART1_SendStr(string);
                break;
               case 'e':
                    sprintf(string," FirstStart_Sec =   ");       UART1_SendStr(string);
                break;
               case 'f':
                    sprintf(string," ReStart_Day =   ");       UART1_SendStr(string);
                break;
               case 'g':
                    sprintf(string," 0 oR 1 =   ");       UART1_SendStr(string);
                break;
                
                
                
              }
              break;
           case '1':
              ControlMode =GetInputVal(coMMand_N);
//              write_flash_segA();
              break;
           case '2':
              AD_AVGtime = GetInputVal(coMMand_N);
              write_flash_segA();
             break;
           case '3':
              motor_T_AD = GetInputVal(coMMand_N);
              write_flash_segA();
             break;
           case '4':
              Set_OriginX = GetInputVal(coMMand_N);
              if(Set_OriginX !=0){
                OpenMotorPower();
                
                DoTheAd(AD_AVGtime,1);  

                CloseMotorPower();
                Set_OriginX =  (int)(Angle_X*100);
              }
              write_flash_segA();
             break;
           case '5':
              Set_OriginY = GetInputVal(coMMand_N);
              if(Set_OriginY !=0){
                OpenMotorPower();
                
                DoTheAd(AD_AVGtime,1);  
                
                CloseMotorPower();
                Set_OriginY =  (int)(Angle_Y*100);
                
              }
              write_flash_segA();              
             break;
           case '6':
              move1deg_T = GetInputVal(coMMand_N);
              write_flash_segA();              
             break;
           case '7':
             frequency_pwm = GetInputVal(coMMand_N);
             write_flash_segA();  
             break;
           case '8':
             percent_pwm = GetInputVal(coMMand_N);
             write_flash_segA();  
             break;
           case '9':
             RunTime = GetInputVal(coMMand_N);
             write_flash_segA();  
             break;
             
           case 'a':
             Hand_X_Time = GetInputVal(coMMand_N);
             break;
           case 'b':
             Hand_X_Dir = GetInputVal(coMMand_N);
             break;
           case 'w':
             Hand_Y_Time = GetInputVal(coMMand_N);
             break;
           case 'd':
             Hand_Y_Dir = GetInputVal(coMMand_N);
             break;

           case 'e':
             FirstStart_Sec = GetInputVal(coMMand_N);
             write_flash_segA();  
             break;
           case 'f':
             ReStart_Day = GetInputVal(coMMand_N);
             write_flash_segA();   
             break;
           case 'g':
             startCount = GetInputVal(coMMand_N);
             break;
             
           }
           coMMand_N = 0;
       }

}

// Timer A0 interrupt service routine   //    if(DoAd) ADC12CTL0 |= ADC12SC;  // Start conversion

int divide = 0;
#pragma vector=TIMERA0_VECTOR
__interrupt void Timer_A (void)
{          //  **** ***** **** 1Hz
  
  WDTCTL = WDT_ARST_1000;                   //--餵狗
  if(startCount){
       divide++;
       if(divide>1){countTime++; divide=0;}
  }
   
    if(outPutcount){
    
      FirstStart ?count_back = FirstStart_Sec - countTime : count_back = ReStart_Sec - countTime ;

      sprintf(string,"剩餘 %5ld 秒開始轉動 /每隔 %2d小時擺\正 \r",count_back,ReStart_Day); 

       UART1_SendStr(string);
      
    }
    
      if( (countTime >= FirstStart_Sec ) && FirstStart)
      {
         //    outPutcount = false;
             FirstStart = false;
             countTime = 0;
           _BIC_SR_IRQ(LPM0_bits);     
      }      
      
       if( (countTime >= ReStart_Sec) &&(!FirstStart)){
         countTime = 0;
         _BIC_SR_IRQ(LPM0_bits);   
       
       }
}

//------------------------------------------------------------------------------
void Rs232_Init(){
                            //------------P3------------------------------------
                            // P3.0(O) P3.1(I) P3.2(I) P3.3(I) P3.4(I) P3.5(I) P3.6(O) P3.7(I)
                            //   ↓      ↑      ↑      ↑      X       X       ↓      ↑
                            // SS(spi)  SIMO    SOMI    SCLK     1       0      TX      RX
                            //   └-------SDHC-----------┘                      └Rs232-┘
                            //------------P3------------------------------------
  P3SEL |= 0xC0;                       // P3.6,7 = USART1 TXD/RXD
  P3DIR |= 0x30;                       // P3.4,P3.5, outputs
  P3OUT |= BIT4;
  P3OUT |= BIT5;
 volatile unsigned int i;  
  BCSCTL1 &= ~XT2OFF;                       // XT2on
  do{
    IFG1 &= ~OFIFG;                           // Clear OSCFault flag
    for (i = 0xFF; i > 0; i--);               // Time for flag to set
  }
  while ((IFG1 & OFIFG));                   // OSCFault flag still set?

  BCSCTL2 |= SELM_2 + SELS;                 // MCLK= SMCLK= XT2 (safe)
  
